{
    "feedback": {
        "thoughts": {
            "general Thoughts": "Space ... is big. Really big. You just won’t believe how vastly, hugely, mindbogglingly big it is. I mean, you may think it’s a long way down the road to the chemist’s, but that’s just peanuts to space."
        },
        "insights": [
            {
                "General Insight": "There is a theory which states that if ever anyone discovers exactly what the Universe is for and why it is here, it will instantly disappear and be replaced by something even more bizarre and inexplicable. There is another theory which states that this has already happened.",
                "Potatoes": "It is a mistake to think you can solve any major problems just with potatoes."
            }
        ]
    },
    "report": {
        "result": {
            "total": 1,
            "message": "All responses processed OK",
            "processed": 1,
            "errors": [],
            "remaining": 0,
            "code": 0
        },
        "evaluations": {
            "42": {
                "conditions": [
                    {
                        "rank": 2,
                        "category": "Vogonic",
                        "classification": "A common mistake that people make when trying to design something completely foolproof is to underestimate the ingenuity of complete fools.",
                        "recommendation": "The chances of finding out what’s really going on in the universe are so remote, the only thing to do is hang the sense of it and keep yourself occupied.",
                        "displayResults": {
                            "additionalInsights": [
                                {
                                    "displayText": "Not unnaturally, many elevators imbued with intelligence and precognition became terribly frustrated with the mindless business of going up and down, up and down, experimented briefly with the notion of going sideways, as a sort of existential protest, demanded participation in the decision-making process and finally took to squatting in basements sulking.",
                                    "displayName": "Intelligent Elevators"
                                },
                                {
                                    "displayText": "The Total Perspective Vortex derives its picture of the whole Universe on the principle of extrapolated matter analyses.To explain — since every piece of matter in the Universe is in some way affected by every other piece of matter in the Universe, it is in theory possible to extrapolate the whole of creation — every sun, every planet, their orbits, their composition and their economic and social history from, say, one small piece of fairy cake. The man who invented the Total Perspective Vortex did so basically in order to annoy his wife.",
                                    "displayName": "The Total Perspective Vortex"
                                },
                                {
                                    "displayText": "It is a well known fact that those people who most want to rule people are, ipso facto, those least suited to do it. To summarize the summary: anyone who is capable of getting themselves made President should on no account be allowed to do the job.",
                                    "displayName": "Leadership"
                                },
                                {
                                    "displayText": "He hoped and prayed that there wasn’t an afterlife. Then he realized there was a contradiction involved here and merely hoped that there wasn’t an afterlife.",
                                    "displayName": "After Life"
                                },
                                {
                                    "displayText": "Since we decided a few weeks ago to adopt the leaf as legal tender, we have, of course, all become immensely rich.",
                                    "displayName": "Currency"
                                }
                            ],
                            "sleepConditions": {
                                "additionalInsights": "There is an art, it says, or rather, a knack to flying. The knack lies in learning how to throw yourself at the ground and miss.",
                                "learnMore": "Insomnia is difficulty falling asleep or staying asleep, even when a person has the chance to do so. \nPeople with insomnia can feel dissatisfied with their sleep and usually experience one or more of the following symptoms: fatigue, low energy, difficulty concentrating, mood disturbances, and decreased performance in work or at school.",
                                "subcondition": "Vogonic Flue",
                                "condition": "Confusion",
                                "mandatoryTips": "Eskimos had over two hundred different words for snow, without which their conversation would probably have got very monotonous.",
                                "mainRecommendation": "Make it totally clear that this gun has a right end and a wrong end. Make it totally clear to anyone standing at the wrong end that things are going badly for them.",
                                "mainText": " It is known that there are an infinite number of worlds, simply because there is an infinite amount of space for them to be in. However, not every one of them is inhabited. Therefore, there must be a finite number of inhabited worlds. Any finite number divided by infinity is as near to nothing as makes no odds, so the average population of all the planets in the Universe can be said to be zero. From this it follows that the population of the whole Universe is also zero, and that any people you may meet from time to time are merely the products of a deranged imagination."
                            }
                        },
                        "riskRating": 2
                    }
                ],
                "algorithm": "18.1.26"
            }
        }
    }
}